ABOUT_MESSAGE = \
f'''Бот предназначен для создания сборки собственного майнера. Для того чтобы создать майнер нужно написать - /order, после чего действуйте инструкции.
Пояснение:
1) кошелек Monero - (обязательно Monero XMR) Если у вас нет своего кошелька, вы можете создать его скачав приложение: (рекомендую) Monero wallet, Exodus wallet
2) Логин - для того чтобы отслеживать свой хешрейт, расчетный доход и выплаты на сайте.
3) Пароль - необязательно
4) Нагрузка на процессор - Вы сами выставляете нагрузку для вашего майнера.
5) Нагрузка при бездействии - Когда ПК бездействует(AFK) больше отмеченного времени, включается режим повышенного майнинга. Как только происходит какая-то активность, майнер выключает повышенный режим.
6) Время бездействия - Выставляется время при котором будет выключен режим повышенного майнинга
'''