ORDER_CANCEL_WARNING = 'Вы уверены, что хотите прервать ввод данных. Они не сохранятся'


ORDER_ENTER_WALLET = 'Введите кошелёк Monero'
ORDER_INVALID_WALLET = 'Некорректный адрес'


ORDER_ENTER_D_LOAD = \
'''Введите нагрузку(%) на процессор при обычном состоянии
(в диапазоне 0..100)
она не должна превышать 60-70%(желательно)'''
ORDER_INVALID_D_LOAD = 'Введите число в диапазоне 0..100'


ORDER_ENTER_I_LOAD = \
'''Введите нагрузку на процессор при длительном бездействии
(она должна больше обычной нагрузки)'''
ORDER_INVALID_I_LOAD = 'Введите число в диапазоне 0..100'


ORDER_ENTER_TIME = 'Введите число при котором майнер включит повышенный режим нагрузки (в минутах)'
ORDER_INVALID_TIME = 'Введите число(минут) в диапазоне %d..%d'


ORDER_ENTER_LOGIN = 'Введите логин(4..50 символов)'
ORDER_INVALID_LOGIN = 'Длина логина должна быть в диапазоне 4..20'
ORDER_ENTER_PASSWORD = 'Введите пароль(4..50 символов)'
ORDER_INVALID_PASSWORD = 'Длина пароля должна быть в диапазоне 4..30 символов'


ORDER_SUCCESS = \
'''Введенные данные успешно отправлены.
В течении 1 дня вам прийдет ответ'''